Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / 27c50e46b11b63f36bdd4e09365a2aab0504ce54
**Workflow run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/18117910695

**Plan (last ~500 lines):**
```
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_partition.current[0]: Reading...
data.aws_availability_zones.available: Reading...
module.karpenter.data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Reading...
module.karpenter_disabled.data.aws_partition.current: Reading...
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.karpenter_disabled.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter_disabled.data.aws_region.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b08e40a119c5800d]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.karpenter_disabled.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.aws_iam_role.this[0]: Refreshing state... [id=cilium-cluster-20250930031420797000000001]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20250930031420800100000002]
data.aws_caller_identity.current: Read complete after 0s [id=039357025931]
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-node-group-20250930031420802300000004]
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=039357025931]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::039357025931:policy/cilium-cluster-20250930031420801200000003]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=039357025931]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=039357025931]
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Read complete after 0s [id=039357025931]
module.karpenter_disabled.data.aws_caller_identity.current: Read complete after 0s [id=039357025931]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::039357025931:assumed-role/gh-actions-role/gha-tf-plan-18117910695]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cilium-cluster-20250930031420797000000001-2025093003142140510000000a]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cilium-cluster-20250930031420797000000001-2025093003142151570000000b]
module.eks_bottlerocket.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cilium-cluster-20250930031420797000000001-20250930031421402900000009]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-node-group-20250930031420802300000004-20250930031421289600000006]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-node-group-20250930031420802300000004-20250930031421313200000008]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0]: Refreshing state... [id=karpenter-node-group-20250930031421178500000005]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-node-group-20250930031420802300000004-20250930031421303700000007]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1187865390]
module.eks_bottlerocket.module.kms.aws_kms_key.this[0]: Refreshing state... [id=1d80ef0b-2f46-4c31-828a-1a30c2b7369b]
module.eks_bottlerocket.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cilium]
module.eks_bottlerocket.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::039357025931:policy/cilium-cluster-ClusterEncryption20250930031442640000000012]
module.eks_bottlerocket.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cilium-cluster-20250930031420797000000001-20250930031442934400000013]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06ce14b610e561300]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0b3c132dbde122de6]
aws_vpc_ipv4_cidr_block_association.pods: Refreshing state... [id=vpc-cidr-assoc-0297c32e72ab90683]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0068bb9319c67f1cf]
module.eks_bottlerocket.aws_security_group.cluster[0]: Refreshing state... [id=sg-0d4ab2f9d865903d4]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0099eea6d5dd0ec9d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c5853bb5ff6ade6b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04b0033147d6bc690]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06629b355d60a6c37]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-09ca487590dd6a7ed]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-0ae4c145461ac320a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b1a9532b91d83907]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-013e2ecc2dd17e469]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-038fde599f87fa998]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a4620e1ebe137fea]
module.eks_bottlerocket.aws_security_group.node[0]: Refreshing state... [id=sg-0515eecb061362ec0]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-0f482530cf7f7fce1]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-098da5f54192c9a6a]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-0f356372786961383]
aws_subnet.pods["us-east-1b"]: Refreshing state... [id=subnet-0c92fe66367679673]
aws_subnet.pods["us-east-1c"]: Refreshing state... [id=subnet-06db356143bb21f33]
aws_subnet.pods["us-east-1a"]: Refreshing state... [id=subnet-0d8a1a3f3e3fffc76]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-024ff0cfb9a19712f]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0306a77ddf6bd870f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-02cda6d798c59e0f7]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06629b355d60a6c371080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-087516a17c7235cf9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0cd8dafc3513b0710]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01cf83131c51fe4d0]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05421babc45acc561]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1542357029]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3379067530]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-559853956]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2915649857]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-102654158]
module.eks_bottlerocket.aws_security_group_rule.node["allow_icmp_from_vpc"]: Refreshing state... [id=sgrule-211402395]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2010583798]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3197465952]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3809471721]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2231439979]
module.eks_bottlerocket.aws_security_group_rule.node["allow_all_from_vpc"]: Refreshing state... [id=sgrule-2721928448]
module.eks_bottlerocket.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2718132167]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-06b2d582128aaacdd]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-07858f4dea86bfc09]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-091a0759d05cf42bf]
aws_route_table_association.pods["us-east-1a"]: Refreshing state... [id=rtbassoc-05189a05f4d5fc08b]
module.eks_bottlerocket.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3458878431]
aws_route_table_association.pods["us-east-1b"]: Refreshing state... [id=rtbassoc-0285581674c825b37]
aws_route_table_association.pods["us-east-1c"]: Refreshing state... [id=rtbassoc-095eb3698ff5f577a]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0fbabe965fb0d703b]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06ce14b610e5613001080289494]
module.eks_bottlerocket.aws_eks_cluster.this[0]: Refreshing state... [id=cilium]
module.eks_bottlerocket.data.tls_certificate.this[0]: Reading...
module.eks_bottlerocket.time_sleep.this[0]: Refreshing state... [id=2025-09-30T03:25:59Z]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-029986887fc0d7ed4,GithubRepo]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-029986887fc0d7ed4,Environment]
module.eks_bottlerocket.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cilium:arn:aws:iam::039357025931:role/gh-actions-role]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-029986887fc0d7ed4,Cluster]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=2749123542293133756]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_eks_access_entry.this[0]: Refreshing state... [id=cilium:arn:aws:iam::039357025931:role/karpenter-node-group-20250930031420802300000004]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/bottlerocket/aws-k8s-1.33/x86_64/latest/image_id]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0fea650fb47515f7b]
module.eks_bottlerocket.data.tls_certificate.this[0]: Read complete after 1s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks_bottlerocket.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::039357025931:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/BF71151714E91781AB61B0699EF22D77]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0]: Refreshing state... [id=karpenter-20250930032605402300000022]
module.eks_bottlerocket.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cilium#arn:aws:iam::039357025931:role/gh-actions-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_addon.pod_identity_agent: Refreshing state... [id=cilium:eks-pod-identity-agent]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250930032531087600000016]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250930032531082900000015]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-qx6qkmhe0bivtjq6h]
module.network.data.aws_eks_cluster_auth.this: Reading...
module.network.data.aws_eks_cluster.this: Reading...
module.network.data.aws_caller_identity.current: Reading...
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250930032531091100000017]
module.network.data.aws_eks_cluster_auth.this: Read complete after 0s [id=cilium]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250930032531091800000018]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=cilium]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/039357025931/Karpenter-cilium]
module.network.data.aws_caller_identity.current: Read complete after 0s [id=039357025931]
module.network.helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
data.kubectl_file_documents.karpenter: Reading...
data.kubectl_file_documents.karpenter: Read complete after 0s [id=dd1b592a0d2070c1984b3238c4ce712a3de420b90d76f16569a8a624fd84e44a]
module.aws_auth.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
data.kubectl_file_documents.letsencrypt: Reading...
data.kubectl_file_documents.letsencrypt: Read complete after 0s [id=0d35e50690b8b7d4ff7e70e6ee54f4b6ea4d2673b7ecdf32ac7a89e94cb5eb7b]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=3608970921]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/039357025931/Karpenter-cilium]
module.network.data.aws_eks_cluster.this: Read complete after 0s [id=cilium]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=cilium-2025093003253146930000001a]
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=3699820454]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=cilium-2025093003253163390000001c]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=2972792992]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=cilium-2025093003253163920000001d]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=cilium-2025093003253156990000001b]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cilium:arn:aws:iam::039357025931:role/cilium]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=3699820454]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250930032531087600000016-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250930032531091100000017-KarpenterInterruptionQueueTarget]
module.network.helm_release.cilium: Refreshing state... [id=cilium]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250930032531082900000015-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250930032531091800000018-KarpenterInterruptionQueueTarget]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::039357025931:policy/KarpenterController-2025093003255681930000001e]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20250930031420800100000002-2025093003255716640000001f]
module.aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.network.helm_release.tetragon: Refreshing state... [id=tetragon]
aws_eks_addon.coredns: Refreshing state... [id=cilium:coredns]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Reading...
module.helm.data.aws_subnets.public: Reading...
module.helm.data.aws_caller_identity.current: Reading...
module.helm.helm_release.karpenter: Refreshing state... [id=karpenter]
module.helm.helm_release.external_dns: Refreshing state... [id=external-dns]
module.helm.data.aws_region.current: Reading...
module.helm.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.helm.data.aws_iam_policy_document.external_dns_policy: Reading...
module.helm.data.aws_iam_policy_document.external_dns_policy: Read complete after 0s [id=2902363378]
module.helm.aws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::039357025931:policy/eks-external-dns-policy]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Read complete after 0s [id=458242647]
module.helm.aws_iam_policy.load_balancer_controller_policy: Refreshing state... [id=arn:aws:iam::039357025931:policy/eks-load-balancer-controller-policy]
module.helm.data.aws_caller_identity.current: Read complete after 0s [id=039357025931]
module.helm.aws_iam_role.eks_ebs_csi_controller: Refreshing state... [id=ebs-csi-controller-role]
module.helm.aws_iam_role.eks_external_dns: Refreshing state... [id=eks-external-dns-role]
module.helm.aws_iam_role.eks_load_balancer_controller: Refreshing state... [id=eks-load-balancer-controller-role]
module.helm.data.aws_subnets.public: Read complete after 1s [id=us-east-1]
module.helm.aws_iam_role_policy_attachment.attach_ebs_csi_policy: Refreshing state... [id=ebs-csi-controller-role-20250930032818237800000025]
module.helm.kubernetes_service_account.eks_ebs_csi_controller: Refreshing state... [id=kube-system/ebs-csi-controller-sa]
module.helm.aws_iam_role_policy_attachment.attach_load_balancer_policy: Refreshing state... [id=eks-load-balancer-controller-role-20250930032818228700000024]
module.helm.kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.helm.aws_iam_role_policy_attachment.attach_external_dns_policy: Refreshing state... [id=eks-external-dns-role-20250930032818269500000026]
module.helm.kubernetes_service_account.external_dns: Refreshing state... [id=kube-system/external-dns]
module.helm.helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
module.helm.helm_release.ebs_csi_driver: Refreshing state... [id=aws-ebs-csi-driver]
module.helm.helm_release.ingress-nginx: Refreshing state... [id=ingress-nginx]
module.helm.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.helm.helm_release.argocd: Refreshing state... [id=argocd]
module.helm.helm_release.jaeger: Refreshing state... [id=jaeger]
module.helm.helm_release.otel_collector: Refreshing state... [id=otel-collector]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.karpenter["/apis/karpenter.k8s.aws/v1/ec2nodeclasses/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.k8s.aws/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1
            kind: EC2NodeClass
            metadata:
              name: bottlerocket
            spec:
              amiSelectorTerms:
              - alias: bottlerocket@latest
              blockDeviceMappings:
              - deviceName: /dev/xvdb
                ebs:
                  deleteOnTermination: true
                  encrypted: true
                  iops: 3000
                  volumeSize: 20Gi
                  volumeType: gp3
              role: cilium
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              tags:
                karpenter.sh/discovery: cilium
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter["/apis/karpenter.sh/v1/nodepools/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1
            kind: NodePool
            metadata:
              name: bottlerocket
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 5000
              template:
                metadata:
                  labels:
                    workload: apps
                spec:
                  nodeClassRef:
                    group: karpenter.k8s.aws
                    kind: EC2NodeClass
                    name: bottlerocket
                  requirements:
                  - key: node.kubernetes.io/instance-type
                    operator: In
                    values:
                    - t3.medium
                  - key: karpenter.sh/capacity-type
                    operator: In
                    values:
                    - on-demand
                  startupTaints:
                  - effect: NoSchedule
                    key: node.cilium.io/agent-not-ready
                    value: "true"
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.letsencrypt["/apis/cert-manager.io/v1/namespaces/cert-manager/clusterissuers/letsencrypt-staging"] will be created
  + resource "kubectl_manifest" "letsencrypt" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-staging"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-staging
              namespace: cert-manager
            spec:
              acme:
                email: johnmonteiro78@yahoo.com
                privateKeySecretRef:
                  name: letsencrypt-staging
                server: https://acme-staging-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      ingressClassName: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.helm.helm_release.loki will be created
  + resource "helm_release" "loki" {
      + atomic                     = true
      + chart                      = "loki-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "giropops-senhas"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                "grafana":
                  "enabled": false
                "loki":
                  "auth_enabled": false
                  "commonConfig":
                    "replication_factor": 1
                  "enabled": true
                  "schemaConfig":
                    "configs":
                    - "from": "2024-01-01"
                      "index":
                        "period": "24h"
                        "prefix": "index_"
                      "object_store": "filesystem"
                      "schema": "v13"
                      "store": "tsdb"
                  "service":
                    "port": 3100
                    "type": "ClusterIP"
                  "serviceMonitor":
                    "enabled": true
                  "singleBinary":
                    "enabled": true
                  "storage":
                    "type": "filesystem"
                "promtail":
                  "config":
                    "clients":
                    - "url": "http://loki.giropops-senhas.svc.cluster.local:3100/loki/api/v1/push"
                    "positions":
                      "filename": "/run/promtail/positions.yaml"
                    "scrape_configs":
                    - "job_name": "kubernetes-pods"
                      "kubernetes_sd_configs":
                      - "role": "pod"
                      "pipeline_stages":
                      - "cri": {}
                      - "regex":
                          "expression": ".*(?:trace[id|_id|Id]|otel.trace_id)=(?P<trace_id>[A-Za-z0-9]+).*"
                      - "labels":
                          "trace_id": ""
                      "relabel_configs":
                      - "source_labels":
                        - "__meta_kubernetes_pod_node_name"
                        "target_label": "node"
                      - "source_labels":
                        - "__meta_kubernetes_namespace"
                        "target_label": "namespace"
                      - "source_labels":
                        - "__meta_kubernetes_pod_name"
                        "target_label": "pod"
                      - "source_labels":
                        - "__meta_kubernetes_pod_container_name"
                        "target_label": "container"
                      - "source_labels":
                        - "__meta_kubernetes_pod_label_app_kubernetes_io_name"
                        "target_label": "app"
                      - "action": "replace"
                        "regex": "(.+)"
                        "source_labels":
                        - "__meta_kubernetes_pod_label_app"
                        "target_label": "app"
                      - "action": "replace"
                        "replacement": "/var/log/pods/*$1/*.log"
                        "source_labels":
                        - "__meta_kubernetes_pod_uid"
                        - "__meta_kubernetes_pod_container_name"
                        "target_label": "__path__"
                    "server":
                      "grpc_listen_port": 0
                      "http_listen_port": 3101
                  "enabled": true
                  "extraVolumeMounts":
                  - "mountPath": "/run/promtail"
                    "name": "run-promtail"
                  "extraVolumes":
                  - "emptyDir": {}
                    "name": "run-promtail"
                  "serviceMonitor":
                    "enabled": true
                    "labels":
                      "release": "kube-prometheus-stack"
            EOT,
        ]
      + verify                     = false
      + version                    = "2.10.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
